Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/HillCipherAttack/Properties/Resources.*.resx
Languages: de

# CCaption
source: Cipher Input
de: Eingabe Geheimtext

source: Cipher
de: Geheimtext

# CTooltip
source: Cipher Text Input
de: Geheimtext Eingabe

# DictCaption
source: Dictionary
de: Wörterbuch

# DictTooltip
source: Dictionary for Plaintext generation
de: Wörterbuch für die Generierung des klartexts

# ErrorMessage
source: Error: {0}
de: Fehler: {0}

# HillCipherAttackCaption
source: Kown/Unkown Plaintext Attack for Hill Cipher
de: Kown-Plaintext/Ciphertext-Only Attacke für die Hill-Chiffre

# HillCipherAttackTooltip
source: Implements the Known/Unkown Plaintext Attack for Hill Cipher
de: Implementierung der Kown-Plaintext/Ciphertext-Only Attacke für Hill Cipher

# IncorrectKey
source: The calculated key is incorrect.
de: Der berechnete schlüssel is nicht korrekt.

# InputContainsIllegalCharacter
source: There is a not allowed character in the Input
de: Die eingabe enthält einen nicht erlaubten Buchstaben.

# InvalidException
source: Invalid text matrix
de: Die Matrix des Textes ist nicht korrekt.

# KCaption
source: Key
de: Schlüssel

# KDimCaption
source: Keydimension
de: Dimensions des Schlüssels

# KDimTooltip
source: The Dimension of the key Matrix
de: Dimension der Schlüsselmatrix

source: Key
de: Schlüssel

source: Keydimension
de: Dimension des Schlüssels

# KeyValue
source: Key: {0}
de: Schlüssel: {0}

# KMatCaption
source: Key Matrix
de: Schlüsselmatrix

# KMatTooltip
source: Key Matrix as numbers
de: Schlüsselmatrix mit gsnzrn Zahlen

# KTooltip
source: Key Text Output
de: Ausgabe des Schlüssels als Text

# MultiplicationException
source: Exception: The number of columns of the first matrix must be equal to the number of rows of the second matrix.
de: Exception: Die Anzahl der Spalten der ersten Matrix muss gleich der Anzahl der Zeilen der zweiten Matrix sein.

# NoDictionary
source: No Dictionary available
de: Es ist kein Dictionary verfügbar.

# NoIdentityMatrix
source: There is no Identity Matrix
de: Es liegt keine Identitätsmatrix vor.

# NoKeyFound
source: The key cannot be calculated.
de: Der Schlüssel konnte nicht berechnet werden.

# NoSquareMatrix
source: Exception: The Matrix is not square.
de: Exception: Es liegt keine quadratische Matrix vor.

# NotEnoughData
source: There are not enough values for the dimension {0} to execute the calculation.
de: Es liegen nicht genügend Werte für die Berechnung für die Dimension {0} vor.

# NotInvertable
source: The matrix {0} is not invertable.
de: Die matrix {0} ist nicht invertierbar.

# NoValidKeyForDim
source: There is no valid key in dimension {}
de: Es gibt keinen gültigen schlüssel für die dimension {0}.

# PCaption
source: Plaintext Input
de: Eingabe des Klartexts

source: Plaintext
de: Klartext

# PTooltip
source: Plain Text Input
de: Klartext Eingabe
