Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/Blockchain/Properties/Resources.*.resx
Languages: de

# AddressesCaption
source: Addresses
de: Adressen

# AddressesTooltip
source: All addresses (Format: "Name, N, e, d")
de: Alle Adressen (Format: "Name, N, e, d")

# BadSignatureCaption
source: Bad signature
de: Ungültige Signatur

# BadSignatureInCaption
source: Bad Signature in:
de: Ungültige Signatur in:

# BalanceTableCaption
source: Balance
de: Coins

# BlockchainTooltip
source: Simulation of blockchain mining process.
de: Implementierung einer Blockchain Komponente.

# BlockTooltip
source: Hashed Block data
de: Gehashte Block Daten

# ChainValidCaption
source: Is chain valid?
de: Gültige Blockchain?

# ErrorTableCaption
source: Error
de: Fehler

# ExceptionCaption
source: Exception occured: {0}
de: Es trat eine Ausnahme auf: {0}

# FailedCaption
source: Failed
de: Fehlgeschlagen

# FailedTransactionCaption
source: Failed transactions:
de: Fehlgeschlagene Transaktionen:

# FromCaption
source: From:
de: Sender:

# FromTableCaption
source: From
de: Sender

# HashCaption
source: Hash:
de: Hashwert:

# HashValueTableCaption
source: Hash
de: Hashwert

# InsufficientBalanceCaption
source: Insufficient balance
de: Nicht genug Münzen

# InsuffiecientBalanceInCaption
source: Insufficient balance in transaction:
de: Nicht genug Münzen fuer Transaktion:

# InvalidAddressCaption
source: Invalid address input
de: Ungültige Adresse (input)

# InvalidTransactionCaption
source: Invalid or incomplete transactions (Check format)
de: Ungültige Transaktionen

# InvalidValueCaption
source: Invalid value
de: Ungültige Transaktion

# millisCaption
source: milliseconds
de: Millesekunden

# MiningAddressErrorCaption
source: Mining address not an address
de: Mining Adresse ist keine ungültig

# NegativeValueCaption
source: Negative value in transaction
de: Ungültige Transaktion (negativer Wert)

# nextblockCaption
source: Next block
de: Nächster Block

# nextblockTooltip
source: Output for next block
de: Ausgabe fuer nächsten Block

# NoJSONStringCaption
source: Wrong format in previous block (needed to be JSON)
de: Vorheriger Block Eingabe hat falsches Format

# NoTransactionCaption
source: No transaction
de: Keine Transaktion

# NoValidMiningAddressCaption
source: Mining address does not exist or is not valid
de: Mining Adresse existiert nicht oder ist nicht valide

# PreviousblockCaption
source: Previous block
de: Vorheriger Block

# PreviousblockhashCaption
source: Previous block hash:
de: Hash des vorherigen Blocks:

# PreviousblockTooltip
source: Previous block input (Connect to blockchain component)
de: Eingabe des vorherigen Blocks (Mit Blockchain Komponente verbinden)

# PrevTransactionHashCaption
source: Previous transaction hash:
de: Hashwert der vorherigen Transaktion:

# PrevTransactionTableCaption
source: Previous transaction hash
de: Hashwert der vorherigen Transaktion

# SettingsMiningAddressCaption
source: Mining address
de: Mining Adresse

# SettingsMiningAddressTooltip
source: Change the mining address
de: Mining Adresse auswählen

# SignatureCaption
source: Signature:
de: Signatur:

# SignatureTableCaption
source: Signature
de: Signatur

# SignatureVerifiedCaption
source: Signature verified
de: Gültige Signatur

# SuccessfullCaption
source: Successfull
de: Erfolgreich

# TimeSpentCaption
source: Time spent: {0} ms
de: Dauer: {0} ms

# TimestampCaption
source: Timestamp:
de: Zeitstempel:

# ToCaption
source: To:
de: Empfänger:

# toCaption1
source: to
de: zu

# ToTableCaption
source: To
de: Empfänger

# TransactionCaption
source: Transaction
de: Transaktion

# TransactionsCaption
source: Transactions:
de: Transaktionen:

# TransactionTooltip
source: Transaction data (string separated with ',' with sender address, recipient address, amount, and transaction signature)
de: Transaktionen (Format: "Sender,Empfänger,Coins,Signatur" (Getrennt durch ","))

# BlockHashUICaption
source: Block hash:
de: Block Hashwert:

# HashAlgorithmUICaption
source: Hash algorithm:
de: Hash-Algorithmus:

# PrevBlockHashUICaption
source: Previous block hash:
de: Vorheriger Block:

# ToAddressUICaption
source: Recipient
de: Empfänger

# TransactionsUICaption
source: Transactions
de: Transaktionen

# InvalidAddressInTransaction
source: Invalid adress in transaction
de: Ungültige Adresse in Transaktion (Format überprüfen)

# GenTransactionWarning
source: No transactions possible in Genesis Block
de: Keine Transaktionen im Genesis Block möglich

source: Invalid address name
de: Ungültiger Name in Adresse

# MiningDifficultyWarning
source: Mining difficulty higher than hash algorithm
de: Mining Schwierigkeit ist höher als das Bit Limit des Hash Algorithmus

# MiningDifficultyCaption
source: Mining difficulty:
de: Mining Schwierigkeit:

# StatisticsCaption
source: Statistics
de: Statistik

# ChangeAddress
source: Change the mining address
de: Änderung der Mining-Adresse

# ChangeHashAlgo
source: Change the hash algorithm
de: Änderung des Hash-Algorithmus

source: Change mining difficulty
de: Änderung der Mining-Schwierigkeit

# ChangeReward
source: Change the mining reward
de: Veränderung der Mining-Belohnung

# ChangeWidth
source: Change the hash algorithm width (number of used bytes)
de: Änderung der Hash-Algorithmus Breite (Anzahl an Bytes)

# GenBlockPrevHashCaption
source: Genesis block previous hash has to be 0
de: Genesis Block vorheriger Hash muss 0 sein

# GenBlockPrevIDCaption
source: Genesis block previous block id has to be 0
de: Genesis Block vorherige ID muss 0 sein

# HashAlgo
source: Hash algorithm
de: Hash-Algorithmus

# HashWidth
source: Hash algorithm width
de: Hash-Algorithmus Breite

# HashWidthErrorCaption
source: The hash algorithm width is invalid. Use 1 instead
de: Die Hash-Algorithmus Breite is ungültih. Benutzen Sie bitte 1

# InvalidBlockHashCaption
source: Block hash is invalid
de: Block-Hashwert ist ungültig

# LowZeroesCaption
source: Number of zeros in block hash is too low
de: Zu wenige Nullen im Block-Hashwert

source: Mining address
de: Mining-Adresse

source: Mining difficulty
de: Mining-Schwierigkeit

# MiningReward
source: Mining reward (in coins)
de: Mining-Belohnung (In Coins)

# NoErrorCaption
source: No Error
de: Kein Fehler

# PreviousBlockHashWrongCaption
source: Previous block hash wrong
de: Vorheriger Block-Hashwert ist falsch

# PreviousBlockIDWrongCaption
source: Previous block ID wrong
de: Vorherige Block-ID ist falsch
