Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/Typex/Properties/Resources.*.resx
Languages: de

# CustomReflectorCaption
source: Custom reflector
de: Benutzerdefinierter Reflektor

# CustomReflectorTooltip
source: Sets the custom reflector
de: Setzt den benutzerdefinierten Reflektor

# InputTextCaption
source: Text input
de: Texteingabe

# InputTextTooltip
source: Input a string to be processed by the cipher
de: Eingabe einer Zeichenkette, die von der Chiffre verarbeitet werden soll

# IsReversedCaption
source: Is reversed
de: Ist umgekehrt

# IsReversedTooltip
source: Sets if this rotor or stator is put in reversed into the machine
de: Legt fest, ob dieser Rotor oder Stator in umgekehrter Richtung in die Maschine eingesetzt wird

# KeyInputCaption
source: Key input
de: Schlüssel-Eingabe

# KeyInputTooltip
source: Input a Typex key containing the rotors to use, the rings to use, and the plugboard connections.
de: Eingabe eines Enigma-Schlüssels, der die zu verwendenden Rotoren, Ringe und Steckbrett-Verbindungen beinhaltet

# OutputTextCaption
source: Text output
de: Textausgabe

# OutputTextTooltip
source: The result output text of the machine
de: Der ausgegebene Text der Machine

# PluginTooltip
source: Component implementing the Typex machine
de: Implementierung der Typex-Maschine

# PlugSettingsCaption
source: Plug settings
de: Steckereinstellungen

# PlugSettingsGroupName
source: Plug settings
de: Steckereinstellungen

# PlugSettingsTooltip
source: Sets the plug settings
de: Legt die Steckereinstellungen fest

# RingPositionsCaption
source: Ring positions
de: Ringpositionen

# RingPositionsTooltip
source: Sets the position of the rings of the rotors
de: Legt die Position der Ringe der Rotoren fest

# Rotor1Tooltip
source: Sets rotor 1 (fast rotor, right)
de: Setzt Rotor 1 (schneller Rotor, rechts)

# Rotor2Tooltip
source: Sets rotor 2 (medium fast rotor, middle)
de: Setzt Rotor 2 (mittelschneller Rotor, Mitte)

# Rotor3Tooltip
source: Sets rotor 3 (slow rotor, left)
de: Setzt Rotor 3 (langsamer Rotor, links)

# RotorPositionsCaption
source: Rotor positions
de: Rotorpositionen

# RotorPositionsGroupName
source: Rotor positions
de: Rotorpositionen

# RotorPositionsTooltip
source: Set the start positions of the rotors
de: Einstellen der Startpositionen der Rotoren

# RotorSelectionGroupName
source: Rotor selection
de: Auswahl der Rotore

# Stator1Tooltip
source: Sets stator 1 (right stator)
de: Stator 1 (rechter Stator) einstellen

# Stator2Tooltip
source: Sets stator 2 (left stator)
de: Stator 2 (linker Stator) einstellen

# TypexMachineTypeCaption
source: Machine type
de: Typ der Maschine

# TypexMachineTypeTooltip
source: Selects the set of rotors based on the "machine type" (baed on different simulators)
de: Wählt den Rotorsatz auf der Grundlage des "Maschinentyps" aus (basierend auf verschiedenen Simulatoren)

# TypexReflectorCaption
source: Reflector
de: Reflektor

# TypexReflectorGroupName
source: Reflector selection
de: Auswahl des Reflektors

# TypexReflectorTooltip
source: Sets the used reflector
de: Legt den verwendeten Reflektor fest

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen

# UnknownSymbolHandlingList3
source: Replace with '?'
de: Ersetzen durch '?'

# UnknownSymbolHandlingTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
