Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/BaconCipher/Properties/Resources.*.resx
Languages: de

# BaconCipher
source: Baconian Cipher
de: Bacon-Chiffre

# AlphabetTooltip
source: Alphabet used by the Bacon cipher.
de: Alphabet, das von der Bacon-Chiffre verwendet wird.

# BaconTooltip
source: A steganography method by Francis Bacon.
de: Ein Steganographieverfahren von Francis Bacon.

# CharCouldNotBeDecoded
source: Could not decode character "{0}".
de: Konnte Zeichen "{0}" nicht dekodieren.

# CodeNotMappable
source: Could not fully decode since '{tempCode}' is not part of the mapping.
de: Konnte den Chiffriertext nicht vollständig dekodieren, da '{tempCode}' nicht Teil des Mappings ist.

# CharAlreadyMapped
source: The alphabet contains duplicate chars.
de: Das Alphabet enthält doppelte Zeichen.

# OutputModeCaption
source: Output mode
de: Ausgabemodus

# DynamicCodeLengthCaption
source: Dynamic code word length
de: Dynamische Codewortlänge

# DynamicCodeLengthToolTip
source: If dynamic code word length is enabled, only as many bits are used for encoding as are necessary for the size of the alphabet. Otherwise, a fixed size of 5 bits is used for encoding.
de: Wenn die dynamische Codierung aktiviert wird, werden nur so viele Bits für die Codierung verwendet, wie für die Größe des Alphabets nötig ist. Ansonsten wird eine feste Größe von 5 Bits für die Codierung verwendet.

# IgnoringChar
source: Ignoring char "{0}" since it is not part of the alphabet.
de: Das Zeichen "{0}" wird ignoriert, da es nicht Teil des Alphabets ist.

# OutputModeToolTip
source: Specifies how the generated code should be output.
de: Gibt an, wie der generierte Code ausgegeben werden soll.

# InputTextCaption
source: Text input
de: Texteingabe

# InputTextTooltip
source: Input a string to be processed by the Bacon cipher
de: Text, der mit der Bacon Cipher verarbeitet werden soll.

# OutputTextCaption
source: Text output
de: Textausgabe

# OutputTextTooltip
source: Text after being processed by the Bacon cipher.
de: Text, nachdem er mit der Bacon cipher verarbeitet wurde

# ModeTooltip
source: Determine whether the component is in encrypt or decrypt mode.
de: Bestimmt, ob die Komponente zum Ver- oder Entschlüsseln verwendet wird.

# Mode
source: Algorithm mode
de: Modus

# ModeEncrypt
source: Encrypt
de: Verschlüsseln

# ModeDecrypt
source: Decrypt
de: Entschlüsseln

# InputAlphabetCaption
source: External alphabet
de: Externes Alphabet

# InputAlphabetTooltip
source: External input for the alphabet used by the Bacon cipher.
de: Externer Eingang für das Alphabet, das von der Bacon-Chiffre verwendet wird.

# OutputModeBinary
source: Binary
de: Binär

# OutputModeRandomChar
source: Random chars
de: Zufällige Zeichen

# AlphabetTooLong
source: The given alphabet is too long. Please activate dynamic length or provide a alphabet with less than 32 chars.
de: Das angegebene Alphabet ist zu lang. Bitte aktivieren Sie die dynamische Länge oder geben Sie ein Alphabet mit weniger als 32 Zeichen an.

# CodeLengthCaption
source: Code word length
de: Codewortlänge

# CodeLengthToolTip
source: Determines the static length of the codeword.
de: Bestimmt die statische Länge des Codeworts.

# CodeLength
source: Length
de: Länge

# InputCipherCharsCaption
source: Key
de: Schlüssel

# InputCipherCharsTooltip
source: The key used for en- and decryption
de: Der Schlüssel der für Ver- und Entschlüsselung genutzt wird.

# OutputModeExternalInput
source: External ciphertext alphabet
de: Externes Geheimtextalphabet

# ErrorSplitCipherAlphabet
source: Could not parse ciphertext alphabet input. Please use a seperator such as: "{0}". Stopping Execution!
de: Konnte die Eingabe des Chiffretext-Alphabets nicht verarbeiten. Bitte verwenden Sie ein Trennzeichen wie z. B.: "{0}". Ausführung wird angehalten!
