Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/HagelinMachine/Properties/Resources.*.resx
Languages: de

# ApplyButtonCaption
source: Next
de: Weiter

# ApplyButtonTip
source: Apply selected settings
de: Ausgewählte Einstellungen anwenden

# BackButtonCaption
source: Back
de: Zurück

# BackButtonTip
source: Return to the previous window
de: Zum vorherigen Fenster zurückkehren

# BarCamTypesCaption
source: Cam types of the bar:
de: Nockenarten der Stange:

# BarCamTypesTip
source: Indicates how cams influence each of the wheels by typing a string which contains following characters: 0 - never, A - when displaced, B - when not displaced, C - always
de: Zeigt an, wie Nocken jedes der Schlüsselräder beeinflussen, indem ein String eingegeben wird, der folgende Zeichen enthält: 0 - nie, A - wenn versetzt, B - wenn nicht versetzt, C - immer

# BarHasLugsCaption
source: Bar has lugs:
de: Stange hat Schieber:

# BarHasLugsTip
source: Set if the bar has lugs
de: Stellen Sie ein, ob die Stange Schieber hat

# BarLugsCaption
source: Bar lugs:
de: Schieber der Stange:

# BarLugsTip
source: Enumerate the indexes of the lugs of the bar which are to be set active. Indexes are to be separted by the comma sign
de: Nummerieren Sie die Indizes der Schieber der Stange, die aktiviert werden sollen. Indizes müssen durch das Komma-Zeichen getrennt werden

# BarToothTypeCaption
source: Tooth type of the bar:
de: Zahnart der Stange:

# BarToothTypeTip
source: Sets the type of the tooth of Bar
de: Legt den Typ des Zahns der Stange fest

# BarTypeCaption
source: Type of the bar:
de: Art der Stange:

# BarTypeTip
source: Sets the type of the bar
de: Legt den Typ der Stange fest

# CaptionDownWheel1
source: ↓Wheel 1
de: ↓Schlüsselrad 1

# CaptionDownWheel10
source: ↓Wheel 10
de: ↓Schlüsselrad 10

# CaptionDownWheel11
source: ↓Wheel 11
de: ↓Schlüsselrad 11

# CaptionDownWheel12
source: ↓Wheel 12
de: ↓Schlüsselrad 12

# CaptionDownWheel2
source: ↓Wheel 2
de: ↓Schlüsselrad 2

# CaptionDownWheel3
source: ↓Wheel 3
de: ↓Schlüsselrad 3

# CaptionDownWheel4
source: ↓Wheel 4
de: ↓Schlüsselrad 4

# CaptionDownWheel5
source: ↓Wheel 5
de: ↓Schlüsselrad 5

# CaptionDownWheel6
source: ↓Wheel 6
de: ↓Schlüsselrad 6

# CaptionDownWheel7
source: ↓Wheel 7
de: ↓Schlüsselrad 7

# CaptionDownWheel8
source: ↓Wheel 8
de: ↓Schlüsselrad 8

# CaptionDownWheel9
source: ↓Wheel 9
de: ↓Schlüsselrad 9

# CaptionUpWheel1
source: ↑Wheel 1
de: ↑Schlüsselrad 1

# CaptionUpWheel10
source: ↑Wheel 10
de: ↑Schlüsselrad 10

# CaptionUpWheel11
source: ↑Wheel 11
de: ↑Schlüsselrad 11

# CaptionUpWheel12
source: ↑Wheel 12
de: ↑Schlüsselrad 12

# CaptionUpWheel2
source: ↑Wheel 2
de: ↑Schlüsselrad 2

# CaptionUpWheel3
source: ↑Wheel 3
de: ↑Schlüsselrad 3

# CaptionUpWheel4
source: ↑Wheel 4
de: ↑Schlüsselrad 4

# CaptionUpWheel5
source: ↑Wheel 5
de: ↑Schlüsselrad 5

# CaptionUpWheel6
source: ↑Wheel 6
de: ↑Schlüsselrad 6

# CaptionUpWheel7
source: ↑Wheel 7
de: ↑Schlüsselrad 7

# CaptionUpWheel8
source: ↑Wheel 8
de: ↑Schlüsselrad 8

# CaptionUpWheel9
source: ↑Wheel 9
de: ↑Schlüsselrad 9

# CurrentStepCaption
source: Current step:
de: Aktueller Schritt:

# CurrentStepTip
source: Please follow the instructions. With the default settings, there is no need to go over all the steps. Execution can be started any time.
de: Bitte befolgen Sie die Anweisungen. Mit den Standard-Einstellungen müssen Sie nicht alle Schritte durchführen. Die Ausführung kann jederzeit gestartet werden.

# ErrorGeneral
source: Exception occured during execution of HagelinMachine: {0}
de: Fehler aufgetreten während der Ausführung der HagelinMaschine: {0}

# ErrorInvalidLugs
source: Invalid Internal Key definition in bar lugs: {0}
de: Ungültige interne Schlüsseldefinition in Stange Schiebern: {0}

# ErrorInvalidPins
source: Invalid Internal Key definition in wheel pins: {0}
de: Ungültige interne Schlüsseldefinition in Schlüsselräder-Stifte: {0}

# ErrorInvalidSettingsBarLugs
source: The input actve bar lugs are not valid.
de: Die eingegebenen aktiven Stange Schieber sind nicht gültig.

# ErrorInvalidSettingsWheelPositions
source: The input wheel positions are not valid.
de: Die eingegebenen Schlüsselräder Positionen sind nicht gültig.

# ErrorInvalidState
source: Invalid External Key definition in Wheels Starting Positions: {0}
de: Ungültige externe Schlüsseldefinition in Schlüsselräder Startpositionen: {0}

# FVFeatureCaption
source: F-V feature
de: F-V Funktion

# FVFeatureTip
source: The Fixed-Variable feature utilizes the ability of the input ring and the output ring to increase the offset with respect to each other after encrypting every character. When this feature is installed and activated, the relative position of the rings is changed by the current displacement value in each ciphering cycle.
de: Das Fixed-Variable Feature nutzt die Fähigkeit des Eingaberinges und des Ausgaberinges, den Versatz zueinander zu erhöhen, nachdem jeder Buchstabe verschlüsselt wurde. Wenn diese Funktion installiert und aktiviert ist, ändert sich die relative Position der Ringe durch den aktuellen Verschiebungswert in jedem Verschlüsselungszyklus.

# HagelinMachineCaption
source: Hagelin Machine
de: Hagelin Maschine

# HagelinMachineTooltip
source: Implements a selected model of a Hagelin Machine
de: Implementiert ein ausgewähltes Modell einer Hagelin Maschine

# TipDownWheel
source: Rotate the wheel down by 1 position
de: Das Schlüsselrad um 1 Position nach unten drehen

# TipUpWheel
source: Rotate the wheel up by 1 position. The initial wheels state is shown on the panel above
de: Das Schlüsselrad um 1 Position nach oben drehen. Der anfängliche Zustand der Schlüsselräder wird auf dem darüberliegenden Panel angezeigt

# InfoAndControlGroup
source: Info and control
de: Info und Steuerung

# InitialOffsetCaption
source: Initial offset
de: Anfänglicher Versatz

# InitialOffsetTip
source: Shows offset between initial offset input ring and output wring
de: Zeigt den Versatz zwischen dem anfänglichen Eingabering und dem Ausgabering

# InputBarLugsCaption
source: Input bar lugs
de: Eingabe Stange Schieber

# InputBarLugsTip
source: Input numbers of the wheels for which lugs of each bar have to be active. Lugs have to be separated with a comma. Active Lugs for each wheel start from a separate line
de: Geben Sie die Nummern der Schlüsselräder ein, für die Schieber jeder Stange aktiv sein müssen. Schieber müssen durch ein Komma getrennt werden. Aktive Schieber für jedes Schlüsselrad beginnen in einer separaten Zeile

# InputTextCaption
source: Input text
de: Eingabetext

# InputTextTip
source: Plaintext that has to be encrypted or ciphertext that has to be decrypted
de: Klartext, der verschlüsselt werden soll, oder Chiffretext, der entschlüsselt werden soll

# InputWheelPinsCaption
source: Input wheel pins
de: Eingabe Schlüsselräder Stifte

# InputWheelPinsTip
source: Input indexes (letters or numbers) of the pins activated for each wheel. Pins have to be separated with a comma, e.g: "A, B, 11". Pins for each wheel start from a separate line
de: Geben Sie die Indizes (Buchstaben oder Zahlen) der Stifte ein, die für jedes Schlüsselrad aktiviert sind. Stifte müssen durch ein Komma getrennt werden, z.B.: "A, B, 11". Stifte für jedes Schlüsselrad beginnen in einer separaten Zeile

# InputWheelsStateCaption
source: Input wheels initial state
de: Startzustand der Schlüsselräder eingeben

# InputWheelsStateTip
source: Input indexes (letters or numbers) of the initial positions of the wheel. Indexes have to be separated with a comma, e.g: "A, B, 11".
de: Indizes (Buchstaben oder Zahlen) der Startpositionen des Schlüsselrads eingeben. Indizes müssen mit einem Komma getrennt werden, z.B.: "A, B, 11".

# ModelCaption
source: Model:
de: Modell:

# ModelTip
source: Select the model of Hagelin Machine
de: Wählen Sie das Modell der Hagelin Maschine

# NumberOfBarsCaption
source: Number of bars
de: Anzahl der Stangen

# NumberOfBarsTip
source: Sets up the number of slide bars
de: Legt die Anzahl der Schiebestangen fest

# NumberOfWheelsCaption
source: Number of wheels
de: Anzahl der Schlüsselräder

# NumberOfWheelsTip
source: Sets up the number of wheels
de: Legt die Anzahl der Schlüsselräder fest

# OutputKeystreamCaption
source: Output keystream
de: Ausgabe Keystream

# OutputKeystreamTip
source: Values of displacement as a keystream
de: Werte der Verschiebung als Keystream

# OutputReportCaption
source: Output report
de: Ausgabebericht

# OutputReportTip
source: Report explaining intermediate steps
de: Bericht, der die Zwischenschritte erklärt

# OutputTextCaption
source: Output text
de: Ausgabetext

# OutputTextTip
source: Result of encryption or decryption
de: Ergebnis der Verschlüsselung oder Entschlüsselung

# PhraseInReportCoputedDisplacement
source: Cumputed displacement D =
de: Berechnete Verschiebung D =

# PhraseInReportFVFeatureActive
source: FV Feature: active. New offset between input ring and output ring:
de: FV Funktion: aktiv. Neuer Offset zwischen Eingabering und Ausgabering:

# PhraseInReportInputCharacter
source: Input character
de: Eingabezeichen

# PhraseInReportInputText
source: Input text =
de: Eingabetext =

# PhraseInReportNotShifted
source: : not shifted and "has displace when not shifted" tooth Current displacement:
de: : nicht verschoben und "wird verschoben, wenn nicht verschoben" Zahn Aktuelle Verschiebung:

# PhraseInReportOffset
source: Offset between input ring and output ring O =
de: Versatz zwischen Eingabering und Ausgabering O =

# PhraseInReportOutputCharacter
source: Output charachter:
de: Ausgabezeichen:

# PhraseInReportShifted
source: : shifted and "has displace when shifted" tooth Current displacement:
de: : verschoben und "wird verschoben, wenn verschoben" Zahn Aktuelle Verschiebung:

# PhraseInReportSteps
source: -Computing the number of steps for each wheel to be advanced, and the displacement between the input and output characters. -All cases when the conditions are met to increase the dispacement or when the wheels are to be advanced are reported.
de: -Berechnung der Anzahl der Schritte, um jedes Schlüsselrad vorzurücken, und der Verschiebung zwischen den Eingabe- und Ausgabezeichen. -Alle Fälle, bei denen die Bedingungen erfüllt sind, um die Verschiebung zu erhöhen oder wenn die Schlüsselräder vorgeschoben werden sollen, werden gemeldet.

# PresentatinCol1Label
source: Description
de: Beschreibung

# PresentatinCol2Label
source: Wheel 1
de: Rotor 1

# PresentatinCol3Label
source: Wheel 2
de: Rotor 2

# PresentatinCol4Label
source: Wheel 3
de: Rotor 3

# PresentatinCol5Label
source: Wheel 4
de: Rotor 4

# PresentatinCol6Label
source: Wheel 5
de: Rotor 5

# PresentatinCol7Label
source: Wheel 6
de: Rotor 6

# ResetButtonCaption
source: Reset the model and start from Step 1
de: Das Modell zurücksetzen und bei Schritt 1 beginnen

# ResetButtonTip
source: Reset
de: Zurücksetzen

# RotateDownLabel
source: Rotate down
de: Nach unten drehen

# RotateUpLabel
source: Rotate up
de: Nach oben drehen

# SelectedBarsCaption
source: Bars used in this machine:
de: Verwendete Stangen:

# SelectedBarsTip
source: Information about bars: Type Cams Has lugs Effect on the typewheel 1 A00000 Yes Advances if shifted 2 B00000 Yes Advances if shifted 3 0A0000 Yes Advances if shifted 4 0B0000 Yes Advances if shifted 5 00A000 Yes Advances if shifted 6 00B000 Yes Advances if shifted 7 000A00 Yes Advances if shifted 8 000B00 Yes Advances if shifted 9 0000A0 Yes Advances if shifted 10 0000B0 Yes Advances if shifted 11 00000A Yes Advances if shifted 12 B00000 Yes Advances if shifted 13 000000 Yes Advances if shifted 14 BBBBBB Yes Advances if shifted 15 CCCCCC Yes Advances if shifted 16 00CCCC No Advances if shifted 17 CCCCCC No Advances if shifted 18 000000 No Advances if shifted 35 00BBBB Yes Advances if shifted 54 AAAAAA Yes Advances if shifted 56 AA0000 Yes Advances if shifted x57 CA0000 Yes Advances if shifted 60 00AA00 Yes Advances if shifted 64 0000AA Yes Advances if shifted 68 00CCCC Yes Advances if shifted 05 00A000 Yes No effect 106 00B000 Yes No effect 107 000A00 Yes No effect 108 000B00 Yes No effect 109 0000A0 Yes No effect 111 00000A Yes No effect 157 CA0000 Yes No effect Cam types: 0 - never, B - not displaced, A - displaced, C - always
de: Informationen über Stangen: Typ Nocken Hat Schieber Auswirkung auf das Schlüsselrad 1 A00000 Ja Vorwärts, wenn verschoben 2 B00000 Ja Vorwärts, wenn verschoben 3 0A0000 Ja Vorwärts, wenn verschoben 4 0B0000 Ja Vorwärts, wenn verschoben 5 00A000 Ja Vorwärts, wenn verschoben 6 00B000 Ja Vorwärts, wenn verschoben 7 000A00 Ja Vorwärts, wenn verschoben 8 000B00 Ja Vorwärts, wenn verschoben 9 0000A0 Ja Vorwärts, wenn verschoben 10 0000B0 Ja Vorwärts, wenn verschoben 11 00000A Ja Vorwärts, wenn verschoben 12 B00000 Ja Vorwärts, wenn verschoben 13 000000 Ja Vorwärts, wenn verschoben 14 BBBBBB Ja Vorwärts, wenn verschoben 15 CCCCCC Ja Vorwärts, wenn verschoben 16 00CCCC Nein Vorwärts, wenn verschoben 17 CCCCCC Nein Vorwärts, wenn verschoben 18 000000 Nein Vorwärts, wenn verschoben 35 00BBBB Ja Vorwärts, wenn verschoben 54 AAAAAA Ja Vorwärts, wenn verschoben 56 AA0000 Ja Vorwärts, wenn verschoben x57 CA0000 Ja Vorwärts, wenn verschoben 60 00AA00 Ja Vorwärts, wenn verschoben 64 0000AA Ja Vorwärts, wenn verschoben 68 00CCCC Ja Vorwärts, wenn verschoben 05 00A000 Ja Kein Effekt 106 00B000 Ja Kein Effekt 107 000A00 Ja Kein Effekt 108 000B00 Ja Kein Effekt 109 0000A0 Ja Kein Effekt 111 00000A Ja Kein Effekt 157 CA0000 Ja Kein Effekt

# SelectedModelCaption
source: Selected model:
de: Ausgewähltes Modell:

# SelectedModelTip
source: Shows the model which was selected
de: Zeigt das ausgewählte Modell an

# SelectedWheelsCaption
source: Selected wheels:
de: Ausgewählte Schlüsselräder:

# SelectedWheelsTip
source: Shows the wheel types that were selected
de: Zeigt die ausgewählten Radtypen an

# WheelActivePinsCaption
source: Active pins of the wheel:
de: Aktive Stifte des Schlüsselrads:

# WheelActivePinsTip
source: Enumerate the indexes of the pins of the wheel which are to be set active.
de: Die Indizes der Stifte des Schlüsselrads auflisten, die aktiv gesetzt werden sollen.

# WheelLabelsCaption
source: Wheel labels:
de: Schlüsselrad Beschriftungen:

# WheelLabelsTip
source: Shows the labels of each position of the wheel . They may include Latin letters or numbers and have to be separted by the comma sign
de: Zeigt die Beschriftungen jeder Position des Schlüsselrads an. Sie können lateinische Buchstaben oder Zahlen enthalten und müssen durch das Komma getrennt werden

# WheelsStateCaption
source: Wheels' state:
de: Zustand der Schlüsselräder:

# WheelsStateTip
source: Shows the indexes of the positions of each wheel. In the beginning equal to external key. Indexes are to be separted by the comma sign
de: Zeigt die Indizes der Positionen jedes Schlüsselrads an. Zu Beginn gleich dem externen Schlüssel. Indizes müssen durch das Komma getrennt werden

# WheelTypeCaption
source: Type of the wheel:
de: Typ des Schlüsselrads:

# WheelTypeTip
source: Sets up the type of the wheel
de: Legt den Typ des Schlüsselrads fest

# CanStartCaption
source: You can start the execution now by pressing the "Play" button in the top tool bar.
de: Sie können die Ausführung jetzt starten, indem Sie die "Starten"-Schaltfläche in der oberen Werkzeugleiste drücken.

# DecryptCaption
source: Decrypt
de: Entschlüsseln

# EncryptCaption
source: Encrypt
de: Verschlüsseln

# EncryptionDoneCaption
source: Encryption done
de: Verschlüsselung abgeschlossen

# InitialOffsetSetCaption
source: Initial offset:
de: Anfänglicher Versatz:

# InitialOffsetSetTip
source: Sets the initial offset between input ring and output ring
de: Legt den anfänglichen Versatz zwischen Eingangsring und Ausgangsring fest

# ModeOfOperationGroup
source: Mode of operation
de: Betriebsmodus

# OperationModeCaption
source: Operation mode:
de: Operationsmodus:

# OperationModeTip
source: Changes between encryption and decryption modes. For current models, there is no difference
de: Wechselt zwischen den Verschlüsselungs- und Entschlüsselungsmodi. Für aktuelle Modelle gibt es keinen Unterschied

# PrinterOffsetGroup
source: Printer offset
de: Drucker Versatz

# RandomizeLugsCaption
source: Randomize lugs
de: Schieber zufällig setzen

# RandomizeLugsTip
source: Randomly set active lugs
de: Setzt Schieber zufällig aktiv

# RandomizePinsCaption
source: Randomize pins
de: Stifte zufällig setzen

# RandomizePinsTip
source: Randomly set wheel pins
de: Setzt Stifte des Schlüsselrads zufällig

# ReadyToCaption
source: Ready to
de: Bereit zu

# ResetWheelsCaption
source: Reset wheels
de: Schlüsselräder zurücksetzen

# ResetWheelsTip
source: Set all wheels to 1st position
de: Alle Schlüsselräder auf die erste Position setzen

# ShowAllCaption
source: Show all settings
de: Alle Einstellungen anzeigen

# ShowAllTip
source: Show all available settings (not recommended for usage before all the setting-up steps are understood)
de: Alle verfügbaren Einstellungen anzeigen (nicht empfohlen zur Verwendung, bevor alle Schritte verstanden sind)

# ShowBarsCaption
source: Show bars
de: Stangen anzeigen

# ShowOnlyLugsCaption
source: Show only lugs
de: Nur Schieber anzeigen

# ShowOnlyLugsTip
source: Show only lugs and hide other information about side bars
de: Nur Schieber anzeigen und andere Informationen über Seitenstangen verstecken

# ShowWheelsCaption
source: Show wheels
de: Schlüsselräder anzeigen

# Step11Caption
source: 1.1. Select the Hagelin model and the operation mode. The model defines the bars used in the machine and the compatible pinwheels. With the default settings, there is no need to go over all the steps. Execution can be started any time.
de: 1.1. Wählen Sie das Hagelin-Modell und den Betriebsmodus aus. Das Modell definiert die in der Maschine verwendeten Stangen und die kompatiblen Schlüsselräder. Mit den Standardeinstellungen müssen nicht alle Schritte durchgeführt werden. Die Ausführung kann jederzeit gestartet werden.

# Step12Caption
source: 1.2. Selection of the wheels: If the current model allows that, select the pinwheels. Once ready, press Next button
de: 1.2. Auswahl der Schlüsselräder: Wenn das aktuelle Modell dies zulässt, wählen Sie die Schlüsselräder aus. Wenn Sie fertig sind, drücken Sie den Weiter-Button

# Step13Caption
source: 1.3. Select the bars to be used in the Machine. Once ready, press Next button
de: 1.3. Wählen Sie die zu verwendenden Stangen aus. Wenn Sie fertig sind, drücken Sie den Weiter-Button

# Step21Caption
source: 2.1. Setting up pins for the wheels, which constitute the first part of the internal key
de: 2.1. Einrichten von Stiften für die Schlüsselräder, die den ersten Teil des internen Schlüssels darstellen

# Step22Caption
source: 2.2. Setting up lugs of the bars, which constitute the second part of the internal key
de: 2.2. Einrichten von Schiebern der Stangen, die den zweiten Teil des internen Schlüssels darstellen

# Step3Caption
source: 3. Setting up initial positions of the wheels, which constitute the external key
de: 3. Einrichten der Anfangspositionen der Schlüsselräder, die den externen Schlüssel darstellen

# Step4Caption
source: 4. Setting up the operation settings 4.1. Text options 4.2. Position of output ring with respect to the input ring
de: 4. Betriebseinstellungen einrichten 4.1. Textoptionen 4.2. Position des Ausgaberings im Verhältnis zum Eingabering

# TextOptionsGroup
source: Text options
de: Textoptionen

# UnknownSymbolCaption
source: Unknown symbols handling:
de: Unbekannte Symbole behandeln:

# UnknownSymbolTip
source: Set how to handle uknown Symbols
de: Legen Sie fest, wie unbekannte Symbole behandelt werden sollen

# UseZCaption
source: Use Z as space
de: Verwenden Z als Leerzeichen

# UseZTip
source: Consider Z characters as spaces
de: Betrachten Z-Zeichen als Leerzeichen

# UtilitiesGroup
source: Utilities
de: Dienstprogramme

# PhraseInReportActiveAgainst
source: : active against wheel
de: : aktiv gegen Schlüsselrad

# PhraseInReportBar
source: Bar
de: Stange

# PhraseInReportCamTypeA
source: , cam type: A;
de: , Nockentyp: A;

# PhraseInReportCamTypeB
source: , cam type: B;
de: , Nockentyp: B;

# PhraseInReportIsFurtherAdvanced
source: is further advanced. Total advancement steps:
de: ist weiter fortgeschritten. Gesamte Fortschrittsschritte:

# PhraseInReportNotActiveAgainst
source: : not active against wheel
de: : nicht aktiv gegen Schlüsselrad

# PhraseInReportWheel
source: Wheel
de: Schlüsselrad

# WheelStateNotValid
source: The wheel state is not valid.
de: Der Zustand des Schlüsselrads ist nicht gültig.

source: Position currently displayed to user
de: Dem Benutzer angezeigte Position

source: Position currently active
de: Derzeit aktive Position

source: Wheels advancements at this step
de: Schlüsselrad-Fortschritte

source: Wheels with active pins
de: Aktive Stifte

source: Hagelin model
de: Hagelin Modell

# Input
source: Input letter
de: Eingabe Buchstabe

# Output
source: Output letter
de: Ausgabe Buchstabe

source: Custom
de: Benutzerdefiniert

source: CX-52 French version
de: CX-52 franz. Version

source: CX-M late version
de: CX-M späte Version

source: Ignore
de: Ignorieren

source: Remove
de: Entfernen

# ReplaceWithQuestionMark
source: Replace with ?
de: Mit ? ersetzen

# WheelNum1
source: Wheel 1
de: Schlüsselrad 1

# WheelNum2
source: Wheel 2
de: Schlüsselrad 2

# WheelNum3
source: Wheel 3
de: Schlüsselrad 3

# WheelNum4
source: Wheel 4
de: Schlüsselrad 4

# WheelNum5
source: Wheel 5
de: Schlüsselrad 5

# WheelNum6
source: Wheel 6
de: Schlüsselrad 6

# BarNum1
source: Bar 1
de: Stange 1

# BarNum2
source: Bar 2
de: Stange 2

# BarNum3
source: Bar 3
de: Stange 3

# BarNum4
source: Bar 4
de: Stange 4

# BarNum5
source: Bar 5
de: Stange 5

# BarNum6
source: Bar 6
de: Stange 6

# BarNum7
source: Bar 7
de: Stange 7

# BarNum8
source: Bar 8
de: Stange 8

# BarNum9
source: Bar 9
de: Stange 9

# BarNum10
source: Bar 10
de: Stange 10

# BarNum11
source: Bar 11
de: Stange 11

# BarNum12
source: Bar 12
de: Stange 12

# BarNum13
source: Bar 13
de: Stange 13

# BarNum14
source: Bar 14
de: Stange 14

# BarNum15
source: Bar 15
de: Stange 15

# BarNum16
source: Bar 16
de: Stange 16

# BarNum17
source: Bar 17
de: Stange 17

# BarNum18
source: Bar 18
de: Stange 18

# BarNum19
source: Bar 19
de: Stange 19

# BarNum20
source: Bar 20
de: Stange 20

# BarNum21
source: Bar 21
de: Stange 21

# BarNum22
source: Bar 22
de: Stange 22

# BarNum23
source: Bar 23
de: Stange 23

# BarNum24
source: Bar 24
de: Stange 24

# BarNum25
source: Bar 25
de: Stange 25

# BarNum26
source: Bar 26
de: Stange 26

# BarNum27
source: Bar 27
de: Stange 27

# BarNum28
source: Bar 28
de: Stange 28

# BarNum29
source: Bar 29
de: Stange 29

# BarNum30
source: Bar 30
de: Stange 30

# BarNum31
source: Bar 31
de: Stange 31

# BarNum32
source: Bar 32
de: Stange 32
