Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/LorenzSZ42/Properties/Resources.*.resx
Languages: de

# ActionCaption
source: Action
de: Aktion

# ActionTooltip
source: Select the component's action
de: Wählen Sie die Aktion der Komponente aus.

# British
source: British notation
de: Britische Notation

# CannotConvertToBritishNotation
source: Cannot convert to British notation: Invalid binary code (no baudot code element) {0} ('{1}') at position {2}
de: Kann nicht in britische Notation umgewandelt werden: Ungültiger Binärcode (kein Baudot-Code-Element) {0} ('{1}') an Position {2}

# CannotConvertToRawPlaintext
source: Cannot convert to raw plaintext: Invalid binary code (no baudot code element) {0} ('{1}') at position {2}
de: Kann nicht in rohen Klartext umgewandelt werden: Ungültiger Binärcode (kein Baudot-Code-Element) {0} ('{1}') an Position {2}

# CannotConvertToReadableNotation
source: Cannot convert to readable notation: Invalid binary code (no baudot code element) {0} ('{1}') at position {2}
de: Kann nicht in lesbarer Notation umgewandelt werden: Ungültiger Binärcode (kein Baudot-Code-Element) {0} ('{1}') an Position {2}

source: Cannot select psi rule based on dots of Mu2
de: Kann keine Psi-Regel basierend auf den Punkten von Mu2 auswählen

source: Chi2 (1 back)
de: Chi2 (1 vorher)

# ChiWeelPinsNotSetAccordingToRules
source: Chi wheel pins not set according to rules
de: Chi-Rotor-Stifte nicht entsprechend den Regeln gesetzt

# ChiWeelPinsSetAccordingToRules
source: Chi wheel pins set according to rules
de: Chi-Rotor-Stifte entsprechend den Regeln gesetzt

source: Decrypt
de: Entschlüsseln

source: Encrypt
de: Verschlüsseln

source: Entered key does not fulfill all rules:
de: Der eingegebene Schlüssel erfüllt nicht alle Regeln:

# ErrorWhileMachinePerforms
source: Error while machine performs action '{0}': {1}
de: Fehler beim Ausführen der Aktion '{0}' der Maschine: {1}

source: Generate key
de: Schlüssel generieren

# InputBaudotNotationAction
source: Input baudot notation
de: Eingabe-Baudot-Notation

# InputBaudotNotationTooltip
source: Select the input notation of the used Baudot code
de: Wählen Sie die Notation des verwendeten Baudot-Codes für die Eingabe

# InputTextCaption
source: Text input
de: Texteingabe

# InputTextTooltip
source: Input a string to be processed by the cipher
de: Eingabe einer Zeichenkette, die von der Chiffre verarbeitet werden soll

# InvalidKeyDefinition1
source: Invalid key definition. Expected 13 lines but only got {0}
de: Ungültige Schlüsseldefinition. Erwartet wurden 13 Zeilen, aber es wurden nur {0} erhalten

# InvalidKeyDefinition2
source: Invalid key definition. Expected 3 start position definitions. But got {0}
de: Ungültige Schlüsseldefinition. Erwartet wurden 3 Startpositionsdefinitionen. Aber es wurden {0} erhalten

# InvalidKeyDefinition3
source: Invalid key definition. Error in line {0}: Wheel has {1} pins but got {2}
de: Ungültige Schlüsseldefinition. Fehler in Zeile {0}: Das Rotor hat {1} Stifte, aber es wurden {2} erhalten

# InvalidKeyDefinition4
source: Invalid key definition. Found invalid pin symbol '{0}' in line {1}
de: Ungültige Schlüsseldefinition. Ungültiges Stiftsymbol '{0}' in Zeile {1} gefunden

# InvalidKeyGiven
source: Invalid key given: {0}
de: Ungültiger Schlüssel angegeben: {0}

# InvalidKeyStartPosition
source: Invalid key start position definition. '{0}' has {1} pins but got start position {2} (positions start with 0)
de: Ungültige Startpositionsdefinition für Schlüssel. '{0}' hat {1} Stifte, aber die Startposition {2} wurde erhalten (Positionen beginnen mit 0)

# InvalidNumberInDeltaCrossesInWheel
source: Invalid number in delta crosses in wheel '{0}': {1}
de: Ungültige Anzahl im Delta-Kreuzen im Rotor '{0}': {1}

# InvalidNumberOfConsecutiveCrossesInWheel
source: Invalid number of consecutive crosses in wheel '{0}': {1}
de: Ungültige Anzahl von aufeinanderfolgenden Kreuzen im Rotor '{0}': {1}

# InvalidNumberOfConsecutiveDotsInWheel
source: Invalid number of consecutive dots in wheel '{0}': {1}
de: Ungültige Anzahl von aufeinanderfolgenden Punkten im Rotor '{0}': {1}

# InvalidNumberOfCrossesInWheel
source: Invalid number of crosses in wheel '{0}': {1}
de: Ungültige Anzahl von Kreuzen im Rotor '{0}': {1}

# InvalidNumberOfDotsInMu2
source: Invalid number of dots in Mu2: {0}
de: Ungültige Anzahl von Punkten in Mu2: {0}

# InvalidNumberOfDotsInWheel
source: Invalid number of dots in wheel '{0}': {1}
de: Ungültige Anzahl von Punkten im Rotor '{0}': {1}

# InvalidTextInBritishNotation
source: Invalid text in British notation: unknown symbol '{0}' at position {1}
de: Ungültiger Text in britischer Notation: Unbekanntes Symbol '{0}' an Position {1}

# InvalidTextInReadableNotation
source: Invalid text in readable notation: unknown symbol '{0}' (figureShift='{1}') at position {2}
de: Ungültiger Text in lesbarer Notation: Unbekanntes Symbol '{0}' (figureShift='{1}') an Position {2}

# KeyInputCaption
source: Key input
de: Schlüssel-Eingabe

# KeyInputTooltip
source: Input a Lorenz SZ42 key
de: Eingabe des Schlüssels der Lorenz SZ42-Maschine

# KeyOutputTooltip
source: Outputs the used or generated Lorenz SZ42 key
de: Gibt den verwendeten oder erzeugten Lorenz SZ42-Schlüssel aus

# LimitationCaption
source: Motor limitation
de: Motorbeschränkung

# LimitationTooltip
source: Select a limitation for the motor
de: Wählen Sie eine Beschränkung für den Motor

# Mu1WeelPinsNotSetAccordingToRules
source: Mu1 wheel pins not set according to rules
de: Mu1-Rotor-Stifte nicht entsprechend den Regeln gesetzt

# Mu1WeelPinsSetAccordingToRules
source: Mu1 wheel pins set according to rules
de: Mu1-Rotor-Stifte entsprechend den Regeln gesetzt

# Mu2WeelPinsNotSetAccordingToRules2
source: Mu2 wheel pins not set according to rules
de: Mu2-Rotor-Stifte nicht entsprechend den Regeln gesetzt

# Mu2WeelPinsSetAccordingToRules
source: Mu2 wheel pins set according to rules
de: Mu2-Rotor-Stifte entsprechend den Regeln gesetzt

source: No key provided
de: Kein Schlüssel gegeben

source: No limitation
de: Keine Limitierung

# OutputBaudotNotationAction
source: Output baudot notation
de: Ausgabe-Baudot-Notation

# OutputBaudotNotationTooltip
source: Select the output notation of the used Baudot code
de: Wählen Sie die Notation des verwendeten Baudot-Codes für die Ausgabe

# OutputTextCaption
source: Text output
de: Textausgabe

# OutputTextTooltip
source: The result output text of the machine
de: Der ausgegebene Text der Machine

# P5_2BACK
source: Plaintext bit 5 (2 back)
de: Klartext Bit 5 (2 vorher)

# PluginTooltip
source: Component implementing the Lorenz SZ42 machine
de: Implementierung der Lorenz SZ42-Maschine

source: Psi1 (1 back)
de: Psi1 (1 vorher)

# PSI1_1BACK_P5_2BACK
source: Psi1 (1 back) and plaintext bit 5 (2 back)
de: Psi1 (1 vorher) und Klartext Bit 5 (2 vorher)

# PsiWeelPinsNotSetAccordingToRules
source: Psi wheel pins not set according to rules
de: Psi-Rotor-Stifte nicht entsprechend den Regeln gesetzt

# PsiWeelPinsSetAccordingToRules
source: Psi wheel pins set according to rules
de: Psi-Rotor-Stifte entsprechend den Regeln gesetzt

# Raw
source: Raw text
de: Roher Text

# Readable
source: Readable notation
de: Lesbare Notation
