Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/SyllabaryCipher/Properties/Resources.*.resx
Languages: de

# ActionCaption
source: Action
de: Aktion

# ActionTooltip
source: Select the algorithm action (encryption or decryption)
de: Wählen Sie die Algorithmus-Aktion (Verschlüsselung oder Entschlüsselung)

# CiphertextNotDivisibleByTwo
source: Input ciphertext length is not divisable by two. Append a '0' to the ciphertext
de: Die Länge des eingegebenen Chiffretextes ist nicht durch zwei teilbar. Hänge eine '0' an den Geheimtext an

source: CrypTool substitution key
de: CrypTool-Substitutionsschlüssel

source: Decrypt
de: Entschlüsselung

# DigitKeyCaption
source: Digit key
de: Ziffern-Schlüssel

# DigitKeyTooltip
source: Input a 20-digit key that is used by the cipher for en- and decryption
de: Eingabe eines 20-stelligen Ziffern-Schlüssels, der von der Chiffre zur Ver- und Entschlüsselung verwendet wird

# DuplicateColumnKeyElement
source: Invalid key entered: Column index contains digit '{0}' more than once
de: Ungültiger Schlüssel eingegeben: Spaltenindex enthält Ziffer '{0}' mehr als einmal

# DuplicateRowKeyElement
source: Invalid key entered: Row index contains digit '{0}' more than once
de: Ungültiger Schlüssel eingegeben: Zeilenindex enthält Ziffer '{0}' mehr als einmal

source: Encrypt
de: Verschlüsselung

# EncryptionStrategyCaption
source: Encryption strategy
de: Verschlüsselungsstrategie

# EncryptionStrategyTolltip
source: Which encryption strategy is used during encryption. Largest means, the largest n-gram is always used for encryption
de: Legt fest, welche Verschlüsselungsstrategie wird bei der Verschlüsselung verwendet

source: English
de: Englisch

# ExceptionWhileGuiCreation
source: Exception occured during creation of table: {0}
de: Bei der Erstellung der Tabelle ist eine Ausnahme aufgetreten: {0}

source: Formatted
de: Formatiert

source: French
de: Französisch

source: German
de: Deutsch

# InputTextCaption
source: Text input
de: Texteingabe

# InputTextTooltip
source: Input a string to be processed by the cipher
de: Eingabe einer Zeichenkette, die von der Chiffre verarbeitet werden soll

# InvalidKeyElement
source: Invalid key entered: '{0}' is not a valid key element
de: Ungültiger Schlüssel eingegeben: '{0}' ist kein gültiges Schlüsselelement

# InvalidKeyLength
source: Invalid key entered: Key length is not 20
de: Ungültiger Schlüssel eingegeben: Schlüssellänge ist nicht 20

source: Italian
de: Italienisch

# KeywordCaption
source: Keyword
de: Schlüsselwort

# KeywordTooltip
source: A keyword that is used by the cipher for en- and decryption
de: Ein Schlüsselwort, das von der Chiffre zur Ver- und Entschlüsselung verwendet wird

source: Latin
de: Latein

# Longest
source: Longest n-gram
de: Längstes n-Gramm

# MissingColumnKeyElement
source: Invalid key entered: Column index does not contain digit '{0}'
de: Ungültiger Schlüssel eingegeben: Spaltenindex enthält keine Ziffer '{0}'

# MissingRowKeyElement
source: Invalid key entered: Row index does not contain digit '{0}'
de: Ungültiger Schlüssel eingegeben: Zeilenindex enthält keine Ziffer '{0}'

# OutputTextCaption
source: Text output
de: Textausgabe

# OutputTextTooltip
source: The string after processing with the cipher
de: Die Zeichenkette nach Verarbeitung mit der Chiffre

# PluginCaption
source: Syllabary Cipher
de: Syllabar-Chiffre

# PluginTooltip
source: Component implementing the "Syllabary Cipher"
de: Implementierung der Syllabar-Chiffre

source: Random
de: Zufällig

source: Spanish
de: Spanisch

# TableLanguageCaption
source: Table language
de: Tabellensprache

# TableLanguageTooltip
source: Language which is used to created the table
de: Sprache, auf der die Tabelle basieren soll

# TableOutputCaption
source: Table output
de: Tabellenausgabe

# TableOutputFormatCaption
source: Table output format
de: Tabellenausgabeformat

# TableOutputFormatTooltip
source: Format of the table output
de: Format der Tabellenausgabe

# TableOutputTooltip
source: Output of a formatted version of the table or a CrypTool substitution key
de: Ausgabe einer formatierten Version der Tabelle oder eines CrypTool-Substitutionsschlüssels

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen

# UnknownSymbolHandlingList3
source: Replace with '?'
de: Ersetzen durch '?'

# UnknownSymbolHandlingTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
