Repository: Sandra-Matthies/Cryptool2
Catalog: CrypPlugins/RAPPOR/Properties/Resources.*.resx
Languages: de

# AmountOfHashFunctionCaption
source: Amount of hash functions
de: Anzahl der Hash-Funktionen

# AmountOfHashFunctionToolTip
source: This is the amount of hash functions which are being used for the creation of the Bloom filter. The amount of hash functions is also relevant for the differential privacy levels of the RAPPOR mechanism
de: Dies ist die Anzahl der Hash-Funktionen, die für die Erstellung des Bloom-Filters verwendet werden. Die Anzahl der Hash-Funktionen ist auch für die unterschiedlichen Datenschutzstufen des RAPPOR-Mechanismus relevant

# AmountOfInstantaneousRandomizedResponsesCaption
source: Amount of IRR
de: Anzahl von SRR

# AmountOfInstantaneousRandomizedResponsesToolTip
source: This is the amount of instantaneous randomized responses which are being used by the RAPPOR mechanism.
de: Dies ist die Anzahl der momentanen randomisierten Antworten, die vom RAPPOR-Mechanismus verwendet werden.

# BloomFilterInformation
source: The input {1} sets the cells {2} in step {3} of the algorithm.
de: Der Input {1} setzt die Zellen {2} in Schritt {3} des Algorithmus.

# BloomFilterInformation1
source: Algorithm step
de: Algorithmus Schritt

# BloomFilterInformation2
source: : The
de: : Die

# BloomFilterInformation3
source: input sets the cell (
de: Eingabe setzt die Zelle (

# BloomFilterSizeCaption
source: Bloom filter size
de: Größe des Bloom-Filters

# BloomFilterSizeToolTip
source: This is the size of the Boolean array which is being used for the Bloom filter data structure.
de: Dies ist die Größe des booleschen Arrays, das für die Datenstruktur des Bloom-Filters verwendet wird.

# BloomFilterText
source: On this page there is an animation of the insertion process for the Bloom filter data structure. The animation can be controlled via the buttons in the top bar. To start the tool please click the play button in the top area of CT2. The execution of the tool can then be controlled through the animation speed slider and the five buttons in the top area of the Bloom filter tool. To find further instructions on the usage of this tool please consult the RAPPOR online help.
de: Auf dieser Seite ist eine Animation des Einfügevorgangs für die Bloom-Filter-Datenstruktur zu sehen. Die Animation kann über die Schaltflächen in der oberen Leiste gesteuert werden. Um das Tool zu starten, klicken Sie bitte auf den Starten-Button im oberen Bereich von CT2. Die Ausführung des Tools kann dann über den Schieberegler für die Animationsgeschwindigkeit und die fünf Schaltflächen im oberen Bereich des Bloom-Filter-Tools gesteuert werden. Weitere Anleitungen zur Nutzung des Tools finden Sie in der RAPPOR-Online-Hilfe.

source: Data set
de: Datensatz

source: Differential privacy level
de: Diff. Datenschutzstufe

# FPercentageCaption
source: f percentage
de: f Prozentsatz

# FPercentageToolTip
source: This is the value of the f percentage. Please note that the value entered will be divided by 100 for internal calculations.
de: Dies ist der Wert des f-Prozentsatzes. Bitte beachten Sie, dass der eingegebene Wert für interne Berechnungen durch 100 geteilt wird.

source: General
de: Allgemein

source: Hash functions
de: Hash-Funktionen

# HeatMapViewText
source: This page provides a heat map that visualizes how often a cell of the Boolean array has been set. Every cell of the Boolean array represent a bit in the 0-1 sequence. The color of the legend shows how often the bit was set to 1 in all iterations. The first row shows the distribution of the Bloom filter over all iterations. It is visible that the Bloom filter always sets the same cells in every iterations as these are shown in red where as cells that have not been set are shown in black. The second row shows the distribution of the PRR over all {0} iterations. The legend to the left of the rows shows that cells that habe been set in close to {1} times throughout the iterations are colored red. Cells that have been set close to 0 times throught the iterations are colored blued. Cells that have been set around {2} throughout the iterations are colored yellow to green. The third row shows the distribution of the instantaneous randomized response over the iterations.
de: Diese Seite bietet eine Heatmap, die veranschaulicht, wie oft eine Zelle des booleschen Arrays gesetzt wurde. Jede Zelle des booleschen Arrays stellt ein Bit in der 0-1-Sequenz dar. Die Farbe der Legende zeigt an, wie oft das Bit in allen Iterationen auf 1 gesetzt wurde. Die erste Zeile zeigt die Verteilung des Bloom-Filters über alle Iterationen. Es ist zu erkennen, dass der Bloom-Filter in jeder Iteration immer die gleichen Zellen setzt, da diese in rot dargestellt sind, während Zellen, die nicht gesetzt wurden, in schwarz dargestellt sind. Die zweite Zeile zeigt die Verteilung der PRR über alle {0} Iterationen. Die Legende auf der linken Seite der Zeilen zeigt, dass Zellen, die während der Iterationen ca. {1} Mal gesetzt wurden, rot eingefärbt sind. Zellen, die im Verlauf der Iterationen ca. 0 Mal gesetzt wurden, sind blau gefärbt. Zellen, die während der Iterationen etwa {2} mal gesetzt wurden, sind gelb bis grün gefärbt. Die dritte Zeile zeigt die Verteilung der momentanen randomisierten Reaktion über die Iterationen.

source: Input
de: Eingabe

# InputCaption
source: Input
de: Eingabe

# InputToolTip
source: The input of the RAPPOR mechanism
de: Die Eingabe des RAPPOR-Mechanismus

source: IRR
de: SRR

# IterationsCaption
source: Iterations
de: Wiederholungen

# IterationToolTip
source: This is the amount of iterations which is used for the creation of the heat map.
de: Dies ist die Anzahl der Iterationen, die für die Erstellung der Heatmap verwendet wird.

source: Key
de: Schlüssel

source: Next step
de: Nächster Schritt

# ordinalOne
source: st
de: te

# ordinalRest
source: th
de: te

# ordinalThree
source: rd
de: te

# ordinalTwo
source: nd
de: te

# OutputCaption
source: Output
de: Ausgabe

# OutputToolTip
source: The output of the RAPPOR mechanism
de: Die Ausgabe des RAPPOR-Mechanismus

source: Overview
de: Übersicht

# OverviewViewText
source: This page provides an overview of the Boolean arrays created by the RAPPOR mechanism. The first row shows the original Boolean array of the Bloom filter. The second row shows the Boolean array after it has been processed by the PRR. Every following row shows the altered Boolean array after being processed by an IRR. In the graphic, the red line stands for a boolean value in the array that is set to "true". The black line stands for a boolean value in the array that is set to "false".
de: Diese Seite bietet einen Überblick über die booleschen Arrays, welche durch RAPPOR erzeugt wurden. Die erste Zeile zeigt das ursprüngliche boolesche Array des Bloom-Filters. Die zweite Zeile zeigt das boolesche Array nach der Verarbeitung durch das PRR. Jede folgende Zeile zeigt das geänderte boolesche Array nach der Verarbeitung durch eine SRR. In der Grafik steht die rote Linie für einen booleschen Wert im Array, der auf "wahr" gesetzt ist. Die schwarze Linie steht für einen booleschen Wert in dem Array, der auf "falsch" gesetzt ist.

# PPercentageCaption
source: p percentage
de: p Prozentsatz

# PPercentageToolTip
source: This is the value of the p percentage. Please note that the value entered will be divided by 100 for internal calculations.
de: Dies ist der Wert des p-Prozentsatzes. Bitte beachten Sie, dass der eingegebene Wert für interne Berechnungen durch 100 geteilt wird.

source: Previous step
de: Vorheriger Schritt

# pStarText
source: The likelihood of the i cell of S being set, given that the underlying cell of i was not set:
de: Die Ws., dass die Zelle i von S gesetzt wird, unter der Vss., dass die zugrunde liegende Zelle von i nicht gesetzt wurde:

# QPercentageCaption
source: q percentage
de: q Prozentsatz

# QPercentageToolTip
source: This is the value of the q percentage. Please note that the value entered will be divided by 100 for internal calculations.
de: Dies ist der Wert des q-Prozentsatzes. Bitte beachten Sie, dass der eingegebene Wert für interne Berechnungen durch 100 geteilt wird.

# qStarText
source: The likelihood of the i cell of S being set, given that the underlying cell of i was set:
de: Die Ws., dass die Zelle i von S gesetzt wird, unter der Vss., dass die zugrunde liegende Zelle von i gesetzt wurde:

source: Randomized response
de: Randomisierte Antwort

# RandomizedResponseText
source: This page illustrates how the privacy level epsilon (= privacy budget) guaranteed by RAPPOR is calculated using the parameters h, f, q, and p. Epsilon equal to infinity is generated by RAPPOR after PRR is enabled and is the worst case. Epsilon equal to one is generated by RAPPOR after IRR is activated, and represents privacy guaranteed in the general case. The lower the epsilon value, the more privacy is guaranteed.
de: Diese Seite veranschaulicht wie das von RAPPOR garantierte Privacy-Level epsilon (= Datenschutzbudget) anhand der Parameter h, f, q und p berechnet wird. Epsilon gleich unendlich wird von RAPPOR erzeugt, nachdem die PRR aktiviert wurde, und ist der schlimmste Fall. Epsilon gleich Eins wird von RAPPOR erzeugt, nachdem die IRR aktiviert wurde, und steht für die im allgemeinen Fall garantierte Privatsphäre. Je niedriger der epsilon-Wert ist, desto stärker ist der Schutz der Privatsphäre gewährleistet.

# RAPPORElaboration
source: Randomized Aggregatable Privacy-Preserving Ordinal Response
de: Zufallsgenerierte aggregierbare datenschutzfreundliche ordinale Antwort

# RAPPORToolTip
source: Implements the RAPPOR mechanism. It allows for anonymously data collection with tunable privacy gurantees. The RAPPOR mechanism was first published in the paper "RAPPOR: Randomized Aggregatable Privacy-Preserving Ordinal Response" by Úlfar Erlingsson, Vasyl Pihur and Aleksandra Korolova in 2014.
de: Implementiert den RAPPOR-Mechanismus. Er ermöglicht eine anonyme Datenerfassung mit einstellbaren Datenschutzgarantien. Der RAPPOR-Mechanismus wurde erstmals in dem Papier "RAPPOR: Randomized Aggregatable Privacy-Preserving Ordinal Response" von Úlfar Erlingsson, Vasyl Pihur und Aleksandra Korolova im Jahr 2014 veröffentlicht.

# ResetAnimation
source: Reset
de: Zurücksetzen

# ResumeAnimation
source: Resume
de: Fortfahren

# ShortTutorial
source: To start the RAPPOR component press the "Play" button on the toolbar above the CT2 workspace. You can navigate through the component using the five tabs above. The component settings can be accessed in three different ways: (1) by clicking on the gear icon in the upper left corner of the component; or (2) by clicking on the gear icon in the upper right corner of the workspace when the component is selected or (3) simply by pressing the key combination Ctrl + i. You can find more information in the online help. Click on "Play" and then select the "Overview" tab.
de: Um die RAPPOR-Komponente zu starten, drücken Sie die Schaltfläche "Starten" in der Symbolleiste oberhalb des Arbeitsbereichs. Mit den fünf obigen Registerkarten können Sie durch diese Komponente navigieren. Die Einstellungen der Komponente können Sie auf drei verschiedene Arten aufrufen: (1) durch Klicken auf das Zahnrad-Symbol oben links in der Komponente; oder (2) bei markierter Komponente durch Klicken auf das Zahnrad-Symbol oben rechts im Arbeitsbereich oder (3) einfach durch die Tastenkombination Strg + i. Weitere Informationen finden Sie in der Onlinehilfe. Klicken Sie auf Starten und dann auf die Registerkarte "Übersicht".

# timerInput
source: Animation speed
de: Animationsgeschwindigkeit

# variablevalues
source: Variables:
de: Variablen:
